RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/GCC/startup_hc32f472.S
__Vectors_End:
                .equ        __Vectors_Size, __Vectors_End - __Vectors
                .size       __Vectors, . - __Vectors
/*
;<h> Interrupt vector table end.
*/

/*
;<h> Reset handler start.
*/
                .section    .text.Reset_Handler
                .align      2
                .weak       Reset_Handler
                .type       Reset_Handler, %function
                .globl      Reset_Handler
Reset_Handler:
/* Single section scheme.
 *
 * The ranges of copy from/to are specified by following symbols
 *   __etext: LMA of start of the section to copy from. Usually end of text
 *   __data_start__: VMA of start of the section to copy to
 *   __data_end__: VMA of end of the section to copy to
 *
 * All addresses must be aligned to 4 bytes boundary.
 */
StackInit:
                ldr         r1, =__StackLimit
                ldr         r2, =__StackTop

                movs        r0, 0
StackInitLoop:
                cmp         r1, r2
                itt         lt
                strlt       r0, [r1], #4
                blt         StackInitLoop

ClrSramSR:
                ldr         r0, =0x40050810
                movw        r1, #0x1FF
                str         r1, [r0]

                /* Copy data from read only memory to RAM. */
CopyData:
                ldr         r1, =__etext
                ldr         r2, =__data_start__
                ldr         r3, =__data_end__
CopyLoop:
                cmp         r2, r3
                ittt        lt
                ldrlt       r0, [r1], #4
                strlt       r0, [r2], #4
                blt         CopyLoop

CopyData1:
                ldr         r1, =__etext_ramb
                ldr         r2, =__data_start_ramb__
                ldr         r3, =__data_end_ramb__
CopyLoop1:
                cmp         r2, r3
                ittt        lt
                ldrlt       r0, [r1], #4
                strlt       r0, [r2], #4
                blt         CopyLoop1

/* This part of work usually is done in C library startup code.
 * Otherwise, define this macro to enable it in this startup.
 *
 * There are two schemes too.
 * One can clear multiple BSS sections. Another can only clear one section.
 * The former is more size expensive than the latter.
 *
 * Define macro __STARTUP_CLEAR_BSS_MULTIPLE to choose the former.
 * Otherwise define macro __STARTUP_CLEAR_BSS to choose the later.
 */
/* Single BSS section scheme.
 *
 * The BSS section is specified by following symbols
 *   __bss_start__: start of the BSS section.
 *   __bss_end__: end of the BSS section.
 *
 * Both addresses must be aligned to 4 bytes boundary.
 */
                /* Clear BSS section. */
ClearBss:
                ldr         r1, =__bss_start__
                ldr         r2, =__bss_end__

                movs        r0, 0
ClearLoop:
                cmp         r1, r2
                itt         lt
                strlt       r0, [r1], #4
                blt         ClearLoop

ClearBss1:
                ldr         r1, =__bss_start_ramb__
                ldr         r2, =__bss_end_ramb__

                movs        r0, 0
ClearLoop1:
                cmp         r1, r2
                itt         lt
                strlt       r0, [r1], #4
                blt         ClearLoop1

                /* Call the clock system initialization function. */
                bl          SystemInit
                /* Call the application's entry point. */
                bl          entry
                bx          lr
                .size       Reset_Handler, . - Reset_Handler
/*
;<h> Reset handler end.
*/

/*
;<h> Default handler start.
*/
                .section    .text.Default_Handler, "ax", %progbits
                .align      2
Default_Handler:
                b           .
                .size       Default_Handler, . - Default_Handler
/*
;<h> Default handler end.
*/

/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
                .macro      Set_Default_Handler  Handler_Name
                .weak       \Handler_Name
                .set        \Handler_Name, Default_Handler
                .endm

/* Default exception/interrupt handler */

                Set_Default_Handler    NMI_Handler
                Set_Default_Handler    HardFault_Handler
                Set_Default_Handler    MemManage_Handler
                Set_Default_Handler    BusFault_Handler
                Set_Default_Handler    UsageFault_Handler
                Set_Default_Handler    SVC_Handler
                Set_Default_Handler    DebugMon_Handler
                Set_Default_Handler    PendSV_Handler
                Set_Default_Handler    SysTick_Handler

                Set_Default_Handler    IRQ000_Handler
                Set_Default_Handler    IRQ001_Handler
                Set_Default_Handler    IRQ002_Handler
                Set_Default_Handler    IRQ003_Handler
                Set_Default_Handler    IRQ004_Handler
                Set_Default_Handler    IRQ005_Handler
                Set_Default_Handler    IRQ006_Handler
                Set_Default_Handler    IRQ007_Handler
                Set_Default_Handler    IRQ008_Handler
                Set_Default_Handler    IRQ009_Handler
                Set_Default_Handler    IRQ010_Handler
                Set_Default_Handler    IRQ011_Handler
                Set_Default_Handler    IRQ012_Handler
                Set_Default_Handler    IRQ013_Handler
                Set_Default_Handler    IRQ014_Handler
                Set_Default_Handler    IRQ015_Handler
                Set_Default_Handler    EXTINT00_SWINT16_Handler
                Set_Default_Handler    EXTINT01_SWINT17_Handler
                Set_Default_Handler    EXTINT02_SWINT18_Handler
                Set_Default_Handler    EXTINT03_SWINT19_Handler
                Set_Default_Handler    EXTINT04_SWINT20_Handler
                Set_Default_Handler    EXTINT05_SWINT21_Handler
                Set_Default_Handler    EXTINT06_SWINT22_Handler
                Set_Default_Handler    EXTINT07_SWINT23_Handler
                Set_Default_Handler    EXTINT08_SWINT24_Handler
                Set_Default_Handler    EXTINT09_SWINT25_Handler
                Set_Default_Handler    EXTINT10_SWINT26_Handler
                Set_Default_Handler    EXTINT11_SWINT27_Handler
                Set_Default_Handler    EXTINT12_SWINT28_Handler
                Set_Default_Handler    EXTINT13_SWINT29_Handler
                Set_Default_Handler    EXTINT14_SWINT30_Handler
                Set_Default_Handler    EXTINT15_SWINT31_Handler
                Set_Default_Handler    DMA1_Error_Handler
                Set_Default_Handler    DMA1_TC0_BTC0_Handler
                Set_Default_Handler    DMA1_TC1_BTC1_Handler
                Set_Default_Handler    DMA1_TC2_BTC2_Handler
                Set_Default_Handler    DMA1_TC3_BTC3_Handler
                Set_Default_Handler    DMA1_TC4_BTC4_Handler
                Set_Default_Handler    DMA1_TC5_BTC5_Handler
                Set_Default_Handler    DMA1_TC6_BTC6_Handler
                Set_Default_Handler    DMA1_TC7_BTC7_Handler
                Set_Default_Handler    EFM_PEError_ReadCol_Handler
                Set_Default_Handler    EFM_OpEnd_Handler
                Set_Default_Handler    QSPI_Handler
                Set_Default_Handler    DCU1_Handler
                Set_Default_Handler    DCU2_Handler
                Set_Default_Handler    DCU3_Handler
                Set_Default_Handler    DMA2_Error_Handler
                Set_Default_Handler    DMA2_TC0_BTC0_Handler
                Set_Default_Handler    DMA2_TC1_BTC1_Handler
                Set_Default_Handler    DMA2_TC2_BTC2_Handler
                Set_Default_Handler    DMA2_TC3_BTC3_Handler
                Set_Default_Handler    DMA2_TC4_BTC4_Handler
                Set_Default_Handler    DMA2_TC5_BTC5_Handler
                Set_Default_Handler    DMA2_TC6_BTC6_Handler
                Set_Default_Handler    DMA2_TC7_BTC7_Handler
                Set_Default_Handler    MAU_Handler
                Set_Default_Handler    FMAC1_Handler
                Set_Default_Handler    FMAC2_Handler
                Set_Default_Handler    FMAC3_Handler
                Set_Default_Handler    FMAC4_Handler
                Set_Default_Handler    TMR0_1_Cmp_Handler
                Set_Default_Handler    TMR0_2_Cmp_Handler
                Set_Default_Handler    TMR2_1_Cmp_Handler
                Set_Default_Handler    TMR2_1_Ovf_Handler
                Set_Default_Handler    TMR2_2_Cmp_Handler
                Set_Default_Handler    TMR2_2_Ovf_Handler
                Set_Default_Handler    TMR2_3_Cmp_Handler
                Set_Default_Handler    TMR2_3_Ovf_Handler
                Set_Default_Handler    TMR2_4_Cmp_Handler
                Set_Default_Handler    TMR2_4_Ovf_Handler
                Set_Default_Handler    RTC_Handler
                Set_Default_Handler    CLK_XtalStop_Handler
                Set_Default_Handler    PWC_WKTM_Handler
                Set_Default_Handler    SWDT_Handler
                Set_Default_Handler    TMR6_1_GCmp_Handler
                Set_Default_Handler    TMR6_1_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_1_Dte_Handler
                Set_Default_Handler    TMR6_1_SCmp_Handler
                Set_Default_Handler    TMRA_1_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_1_Cmp_Handler
                Set_Default_Handler    TMR6_2_GCmp_Handler
                Set_Default_Handler    TMR6_2_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_2_Dte_Handler
                Set_Default_Handler    TMR6_2_SCmp_Handler
                Set_Default_Handler    TMRA_2_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_2_Cmp_Handler
                Set_Default_Handler    TMR6_3_GCmp_Handler
                Set_Default_Handler    TMR6_3_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_3_Dte_Handler
                Set_Default_Handler    TMR6_3_SCmp_Handler
                Set_Default_Handler    TMRA_3_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_3_Cmp_Handler
                Set_Default_Handler    TMR6_4_GCmp_Handler
                Set_Default_Handler    TMR6_4_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_4_Dte_Handler
                Set_Default_Handler    TMR6_4_SCmp_Handler
                Set_Default_Handler    TMRA_4_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_4_Cmp_Handler
                Set_Default_Handler    TMR6_5_GCmp_Handler
                Set_Default_Handler    TMR6_5_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_5_Dte_Handler
                Set_Default_Handler    TMR6_5_SCmp_Handler
                Set_Default_Handler    TMR6_6_GCmp_Handler
                Set_Default_Handler    TMR6_6_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_6_Dte_Handler
                Set_Default_Handler    TMR6_6_SCmp_Handler
                Set_Default_Handler    TMR6_7_GCmp_Handler
                Set_Default_Handler    TMR6_7_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_7_Dte_Handler
                Set_Default_Handler    TMR6_7_SCmp_Handler
                Set_Default_Handler    TMR6_8_GCmp_Handler
                Set_Default_Handler    TMR6_8_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_8_Dte_Handler
                Set_Default_Handler    TMR6_8_SCmp_Handler
                Set_Default_Handler    TMR6_9_GCmp_Handler
                Set_Default_Handler    TMR6_9_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_9_Dte_Handler
                Set_Default_Handler    TMR6_9_SCmp_Handler
                Set_Default_Handler    TMR6_10_GCmp_Handler
                Set_Default_Handler    TMR6_10_Ovf_Udf_Handler
                Set_Default_Handler    TMR6_10_Dte_Handler
                Set_Default_Handler    TMR6_10_SCmp_Handler
                Set_Default_Handler    TMR4_1_GCmp_Handler
                Set_Default_Handler    TMR4_1_Ovf_Udf_Handler
                Set_Default_Handler    TMR4_1_Reload_Handler
                Set_Default_Handler    TMR4_1_SCmp_Handler
                Set_Default_Handler    CMP1_Handler
                Set_Default_Handler    CMP2_Handler
                Set_Default_Handler    CMP3_Handler
                Set_Default_Handler    CMP4_Handler
                Set_Default_Handler    CAN1_Handler
                Set_Default_Handler    CAN2_Handler
                Set_Default_Handler    CAN3_Handler
                Set_Default_Handler    USART1_Handler
                Set_Default_Handler    USART2_Handler
                Set_Default_Handler    SPI1_Handler
                Set_Default_Handler    SPI2_Handler
                Set_Default_Handler    TMRA_5_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_5_Cmp_Handler
                Set_Default_Handler    TMRA_6_Ovf_Udf_Handler
                Set_Default_Handler    TMRA_6_Cmp_Handler
                Set_Default_Handler    USBFS_Handler
                Set_Default_Handler    EVENT_PORT1_Handler
                Set_Default_Handler    EVENT_PORT2_Handler
                Set_Default_Handler    EVENT_PORT3_Handler
                Set_Default_Handler    EVENT_PORT4_Handler
                Set_Default_Handler    USART3_Handler
                Set_Default_Handler    USART4_Handler
                Set_Default_Handler    SPI3_Handler
                Set_Default_Handler    SPI4_Handler
                Set_Default_Handler    EMB_GR0_Handler
                Set_Default_Handler    EMB_GR1_Handler
                Set_Default_Handler    EMB_GR2_Handler
                Set_Default_Handler    EMB_GR3_Handler
                Set_Default_Handler    EMB_GR4_Handler
                Set_Default_Handler    EMB_GR5_Handler
                Set_Default_Handler    EMB_GR6_Handler
                Set_Default_Handler    HASH_Handler
                Set_Default_Handler    USART5_Handler
                Set_Default_Handler    USART6_Handler
                Set_Default_Handler    MDIO_Handler
                Set_Default_Handler    PLA_Handler
                Set_Default_Handler    I2C1_Handler
                Set_Default_Handler    I2C2_Handler
                Set_Default_Handler    I2C3_Handler
                Set_Default_Handler    USART1_WKUP_Handler
                Set_Default_Handler    PWC_LVD1_Handler
                Set_Default_Handler    PWC_LVD2_Handler
                Set_Default_Handler    OTS_Handler
                Set_Default_Handler    FCM_Handler
                Set_Default_Handler    WDT_Handler
                Set_Default_Handler    CTC_Handler
                Set_Default_Handler    ADC1_Handler
                Set_Default_Handler    ADC2_Handler
                Set_Default_Handler    ADC3_Handler
                Set_Default_Handler    TRNG_Handler
                Set_Default_Handler    USART1_TxComplete_Handler
                Set_Default_Handler    USART2_TxComplete_Handler
                Set_Default_Handler    USART3_TxComplete_Handler
                Set_Default_Handler    USART4_TxComplete_Handler
                Set_Default_Handler    USART5_TxComplete_Handler
                Set_Default_Handler    USART6_TxComplete_Handler

                .end
